
### :robot: Terraform Report
---
##### Plan: `2` to add, `1` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.argocd_app_jaeger[0] will be created
  + resource "helm_release" "argocd_app_jaeger" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-app-jaeger"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications:
                  jaeger:
                    namespace: argocd
                    project: jaeger
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: jaeger
                      repoURL: https://jaegertracing.github.io/helm-charts
                      targetRevision: 3.3.1
                      helm:
                        releaseName: jaeger
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: istio-system
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  jaeger:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project Jaeger for Tracing
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: istio-system
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
        ]
      + verify                     = false
      + version                    = "2.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.argocd_app_kiali[0] will be updated in-place
  ~ resource "helm_release" "argocd_app_kiali" {
        id                         = "argocd-app-kiali"
      ~ metadata                   = [
          - {
              - app_version    = ""
              - chart          = "argocd-apps"
              - first_deployed = 1729813971
              - last_deployed  = 1729856996
              - name           = "argocd-app-kiali"
              - namespace      = "argocd"
              - notes          = ""
              - revision       = 5
              - values         = jsonencode(
                    {
                      - applications = {
                          - kiali = {
                              - destination = {
                                  - namespace = "istio-system"
                                  - server    = "https://kubernetes.default.svc"
                                }
                              - finalizers  = [
                                  - "resources-finalizer.argocd.argoproj.io",
                                ]
                              - namespace   = "argocd"
                              - project     = "kiali"
                              - sources     = [
                                  - {
                                      - chart          = "kiali-server"
                                      - helm           = {
                                          - parameters  = [
                                              - {
                                                  - name  = "auth.strategy"
                                                  - value = "token"
                                                },
                                              - {
                                                  - name  = "external_services.prometheus.url"
                                                  - value = "http://prometheus-server.monitoring.svc.cluster.local"
                                                },
                                              - {
                                                  - name  = "external_services.grafana.enabled"
                                                  - value = "false"
                                                },
                                              - {
                                                  - name  = "external_services.custom_dashboards.enabled"
                                                  - value = "false"
                                                },
                                            ]
                                          - releaseName = "kiali"
                                        }
                                      - repoURL        = "https://kiali.org/helm-charts"
                                      - targetRevision = "2.0.0"
                                    },
                                ]
                              - syncPolicy  = {
                                  - automated   = {
                                      - prune    = true
                                      - selfHeal = true
                                    }
                                  - syncOptions = [
                                      - "CreateNamespace=true",
                                    ]
                                }
                            }
                        }
                      - projects     = {
                          - kiali = {
                              - clusterResourceWhitelist = [
                                  - {
                                      - group = "*"
                                      - kind  = "*"
                                    },
                                ]
                              - description              = "Project Kiali for Service Mesh"
                              - destinations             = [
                                  - {
                                      - namespace = "istio-system"
                                      - server    = "https://kubernetes.default.svc"
                                    },
                                ]
                              - finalizers               = [
                                  - "resources-finalizer.argocd.argoproj.io",
                                ]
                              - namespace                = "argocd"
                              - sourceRepos              = [
                                  - "*",
                                ]
                            }
                        }
                    }
                )
              - version        = "2.0.2"
            },
        ] -> (known after apply)
        name                       = "argocd-app-kiali"
      ~ values                     = [
          - <<-EOT
                applications:
                  kiali:
                    namespace: argocd
                    project: kiali
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: kiali-server
                      repoURL: https://kiali.org/helm-charts
                      targetRevision: 2.0.0
                      helm:
                        releaseName: kiali
                        parameters:
                          - name: auth.strategy
                            value: "token"
                          - name: external_services.prometheus.url
                            value: "http://prometheus-server.monitoring.svc.cluster.local"
                          - name: external_services.grafana.enabled
                            value: "false"
                          - name: external_services.custom_dashboards.enabled
                            value: "false"
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: istio-system
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  kiali:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project Kiali for Service Mesh
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: istio-system
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
          + <<-EOT
                applications:
                  kiali:
                    namespace: argocd
                    project: kiali
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: kiali-server
                      repoURL: https://kiali.org/helm-charts
                      targetRevision: 2.0.0
                      helm:
                        releaseName: kiali
                        parameters:
                          - name: auth.strategy
                            value: "token"
                          - name: external_services.prometheus.url
                            value: "http://prometheus-server.monitoring.svc.cluster.local"
                          - name: external_services.grafana.enabled
                            value: "false"
                          - name: external_services.custom_dashboards.enabled
                            value: "false"
                          - name: external_services.tracing.enabled
                            value: "true"
                          - name: external_services.tracing.internal_url
                            value: "http://jaeger.istio-system.svc.cluster.local:16685/jaeger"
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: istio-system
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  kiali:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project Kiali for Service Mesh
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: istio-system
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # helm_release.argocd_app_rancher[0] will be created
  + resource "helm_release" "argocd_app_rancher" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-app-rancher"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications:
                  rancher:
                    namespace: argocd
                    project: rancher
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: rancher
                      repoURL: https://releases.rancher.com/server-charts/stable
                      targetRevision: 2.9.3
                      helm:
                        releaseName: rancher
                        parameters:
                          - name: ingress.enabled
                            value: "false"
                          - name: tls
                            value: "external"
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: cattle-system
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  rancher:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project Rancher for clusters connections
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: cattle-system
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
        ]
      + verify                     = false
      + version                    = "2.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11527728580`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11527728580) - commit 60458f9ade95544840580e4255de86f00e71a8e4
